# SheetAssemblyTypeComments Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SheetAssemblyTypeComments Property
ParameterTypeId Class See Also
---
"Assembly: Type Comments"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SheetAssemblyTypeComments { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SheetAssemblyTypeComments As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SheetAssemblyTypeComments {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace